app/controllers/blog_entries_controller.rb

  def index
    @blog_entries = BlogEntry.where(:published => true).order("created_at DESC").page(params[:page]).per(3)
---
SELECT "blog_entries".* FROM "blog_entries" WHERE "blog_entries"."published" = 't' ORDER BY created_at DESC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "blog_entries" WHERE "blog_entries"."published" = 't'