app/controllers/home_controller.rb

  def index
    name_of_page = params[:name]
    #binding.pry

    if params["name"]== "listings-for-rent"
      status = PropertyStatus.find_by_name("For Rent").id
      @properties = Property.where("property_status_id = ?", status).page(params[:page]).per(7)
    elsif params["name"]== "listings-for-sale"
      status = PropertyStatus.find_by_name("For Sale").id
      @properties = Property.where("property_status_id = ?", status).page(params[:page]).per(7)
    else
      @properties = Property.page(params[:page]).per(7)
    end

    @addresses = []
    @properties.each do |pro|
---
SELECT "property_statuses".* FROM "property_statuses" WHERE "property_statuses"."name" = 'For Rent' LIMIT 1
SELECT "properties".* FROM "properties" WHERE (property_status_id = 1) ORDER BY created_at DESC LIMIT 7 OFFSET 0
SELECT COUNT(*) FROM "properties" WHERE (property_status_id = 1)
SELECT COUNT(*) FROM "properties"
SELECT "properties".* FROM "properties" ORDER BY created_at DESC LIMIT 1 OFFSET 0